#define _CRT_SECURE_NO_WARNINGS 
#include<stdio.h>
//int main()
//{
//	//int a = 5 / 2;//2,结果为商值
//	//int a = 5 % 2;//1,结果为余值
//	////取模时左右为整数
//	//double a = 5 / 2;//结果为2.500000
//	//右移操作符
//	//算术右移，右移1位为：>>1,右移2位为：>>2
//	//右边丢弃，左边补0;
//	//逻辑右移: 右边丢弃，左边补0；
//	//左移操作符：左边丢弃，右边补0；
//
//	//数组也是有类型的，用sizeof(int[10])//40
//
//
//	return 0;
//}




//反向输出4位数，这是我写的代码，优化版在下面

//int main()
//{
//	int n = 0;
//	int a = 0;
//	int tmp = 0;
//
//   scanf("%d", &n);
//   a = n % 10;
//   tmp = a * 1000;
//   n = (n - a) / 10;
//   a = n % 10;
//   tmp = tmp + a * 100;
//   n = (n - a) / 10;
//   a = n % 10;
//   tmp = tmp + a * 10;
//   n = (n - a) / 10;
//   a = n % 10;
//   tmp = tmp + a;
//   printf("%d", tmp);
//	return 0;
//}


//反向输出4位数

//int main()
//{
//	int n = 0;
//	int a = 0;
//	scanf("%d", &n);
//	while (n)
//	{
//
//		printf("%d", n % 10);
//		a = n % 10;
//		n = n / 10;
//		
//
//	}
//
//	return 0;
//}

//大小写转化，以下有案例与解读
//int main()
//{
////	int ch = 0;
////	while ((ch = getchar()) != EOF)
////	{
////		if (ch != '\n')
////			//if的作用是吸收缓存区里面的'\n'
////		{
////			putchar(ch + 32);
////			printf("\n");
////
////		}
////
////	}
////
//
//
//     int ch = 0;
//      while ((ch = getchar()) != EOF)
//    {
//	      	putchar(ch + 32);
//		    printf("\n");
//			getchar();
//			//getchar()可以再次吸收'\\n'
//			
//	    }
//
//    
//
//
//}

//int main()
//{
//	//int a = 3;
//	//int b = 5;
//	//printf("%d\n", a&b);//1
//	// 011
//	// 101
//	// 001
//	//按位与&的意思是，二进制位同为1则为1，其他情况则为0；
//	//printf("%d\n", a|b);//7
//	//011
//	//101
//	//111
//	//按位或|的意思是，二进制位同时为0则为0，其他情况则为1
//	//printf("%d\n", a^b);
//	//011
//	//101
//	//110
//	//按位异或^的意思是，二进制位相同则为0，相异则为1；
//	//逻辑反操作！的意思是：！假则为真，！真则为假！！！
//	//printf("%d\n", !12);//0
//	//printf("%d\n", !0);//1
//	//sizeof的作用是计算变量与类型的大小
//
////	short s = 0;
////	int a = 5;
////	printf("%d\n",sizeof( s = a + 5));//2
////	printf("%d\n", sizeof s);//0
//	//int a = 0;
//	//printf("%d\n", ~a);//-1
//	//  ~按位取反操作符
//	//00000000000000000000000000000000
//	//按位取反 11111111111111111111111111111111 补码
//	//反码     11111111111111111111111111111110     补码变反码，减1即可
//	//源码     10000000000000000000000000000001     反码变源码，符号位不变其他位按位取反
//
//	//int a = (int)3.14;//(类型)强制类型转换
//
//	return 0;
//}


//坑爹题
//void test1(int arr[])//传参传的是指针类型，所以类型大小为4个字节
//{
//
//	printf("%d\n", sizeof(arr));
//}
//
//void test2(char ch[])//传参传的是指针类型，所以类型大小为4个字节
//{
//
//	printf("%d\n", sizeof(ch));
//
//
//}
//
//int main()
//{
//
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	 test1(arr);
//	 test2(ch);
//
//	return 0;
//}

//int main()
//{
//	//逻辑与
//	//2&&2==1    两边同时为真则为真
//	//@2&&0==0   两边有一个为假则为假
//
//	//逻辑或
//	//2||0==1  两边有一个为真则为真，两边同时为假则为假
//
////	int i = 0, a = 0, b = 2, c = 3, d= 4;
////	i = a++ && b++ && d++;    //0 1 2 3 
//	//如果是逻辑与，左边为真就执行右边的
//
//	//逻辑与是从左往右判断
//	//a++的意思是先使用再++，由于a最初为0，故为假，&&之后不再执行！！！
//	//如果a最初的值为1，那么a为真，&&之后执行，结果为：1 2 3 3 5
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;   //1 1 2 3 4
//	//如果是逻辑或，只要左边为真右边不再执行！！
//
//	printf("i=%d\na=%d\nb=%d\nc=%d\nd=%d\n", i, a, b, c, d);
//
//
//
//
//	return 0;
//}

// 三目操作符
//
//int main()
//{
//	int a = 0;
//	int b = 0;
//	b = (a > 5 ? 3 : -2);
//
//
//	return 0;
//}

//逗号表达式
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 12, a, b = 1 + a);
//	//逗号表达式依次向右执行，执行的最终结果是最终的表达式
//
//
//
//	return 0;
//}

//创建一个结构体类型
struct stu
{
	char name[20];
	int age;
	char id[20];

};

//结构体常用的操作符

//int main()
//{
//	//使用struct stu这个类型创建一个学生对象s1,并初始化
//	struct stu s1 = { "张三", 18, "20220922" };
//	//注意给结构体变量赋值时要用,并且用大括号括起来
//	printf("%s\n%d\n%s\n", s1.name, s1.age, s1.id);
//	struct stu *ps = &s1;
//	//定义指针变量ps指向结构体变量s1的地址
//	printf("%s\n", ps->name);
//	printf("%s\n", (*ps).name);
//	//用指针打印结构体内容
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}

//整形提升
//整形提升的意思是，表达式中字符和短整型操作数在操作之前被转换成普通整形
//字符型与短整型在运算时会出现整形提升
//整形提升是按照变量的数据类型的符号位来提升的
//int main()
//{
//	char a = 3;
//	//a在运算前被转化成普通整形
//	//00000000000000000000000000000011
//
//
//	char b = 127;
//	//00000000000000000000000001111111
//	//a与b相加，00000000000000000000000010000010
//	//加法运算完成后，结果会被截断
//
//	char c = a + b;
//	//10000010-c
//	printf("%d\n", c);
//	//char是有符号类型，高位补充符号位
//	//因为要打印成整形，要进行整形提升
//	//c-11111111111111111111111110000010 补码
//	//c-11111111111111111111111110000001 反码
//	//c-10000000000000000000000001111110 源码
//	//-126
//
//	return 0;
//}

//int main()
//{
//	//printf可以使用使用格式控制串“%md”输出域宽为m的十进制整数。
//	printf("%15d", 0XABCDEF);
//
//
//	return 0;
//}

int main()
{
	int ret = printf("Hello world!");//奇葩的打印方式
	printf("\n");
	//printf有返回值，数值为字符串长度
	printf("%d", ret);

	

	return 0;
}